print ("Καλησπέρα" +\
"!! Χρησιμοποιείται η έκδοση 3.6 της python !!")

print ("ΑΣΚΗΣΗ 4:"+\
"Γράψτε ένα πρόγραμμα το οποίο παίρνει σαν είσοδο μία λίστα και"+\
"επιστρέφει την τυπική απόκλιση των τιμών χωρίς να χρησιμοποιεί τις δύο μεγαλύτερες και δύο μικρότερες τιμές")

lista=[] #δημιουργεία λίστας
size=0

while (size<=4):
    print ("Για την επιτυχή λειτουργία του προγράμματος εισάγεται πάνω από 4 αριθμούς!")
    print ("Για να σταματήσεται την εισαγωγή αριθμών εισάγεται το κενό.(space)")
    ar=(input("Ποιόν αριθμό θέλετε να εισάγεται;"))

#έλεγχοι

    while ((ar>= "a" and ar <="z") or (ar>="A" and ar<="Z") or (ar>="!" and ar<="*") or (ar>= "α" and ar<="ω") or (ar>= "Α" and ar <= "Ω")):
        print ("Εισάγεται αριθμό και όχι χαρακτήρα!")
        ar=(input("Ποιόν αριθμό θέλετε να εισάγεται;"))

    while (ar!=" "):
        lista.append(int(ar))
        size+=1
        ar=(input("Ποιόν αριθμό θέλετε να εισάγεται;"))

#ταξινόμηση λίστας
lista.sort()

#διαγραφή μεγαλύτερων και μικρότερων
i=1
del lista[i:i-1],lista[0:-1]
lista.sort()

#υπολογισμός τυπικής απόκλισης και έλεγχος παρονομαστή

x=sum(lista)
if (x==0):
    print ("Ο παρονομαστής είναι 0. Άρα δεν μπορεί να υπολογιστεί η τυπική απόκλιση!")
else:
    print (x)
#υπολογισμός μέσου όρου
    mesos=x/ar
#υπολογισμός τυπικής απόκλισης
    sarithmitis=0
    for i in range (len(lista)):
        arithmitis= (lista[i]-mesos)**2
        sarithmitis= sarithmitis + arithmitis

    S= sarithmitis/ar
    import math
    print ("Η τυπική απόκλιση της λίστας είναι :", math.sqrt(S))
print ("!!!! ΤΕΛΟΣ ΑΣΚΗΣΗΣ 4 !!!!")
