print ("Καλησπέρα" +\
"!! Χρησιμοποιείται η έκδοση 3.6 της python !!")

print (" ΑΣΚΗΣΗ 3 "+\
"Γράψτε ένα πρόγραμμα το οποίο παίρνει σαν είσοδο μία λίστα και "+\
"μετακινεί τα μηδενικά στοιχεία στο τέλος της λίστας, χωρίς να αλλάζει την σειρά των άλλων στοιχείων.")

#Δημιουργεί την λίστα και ελέγχει


size=0
lista=[]

print ("Για να σταματήσετε την εισαγωγή αριθμών εισάγεται το κενό.(space)")

ar=(input("Αριθμός στην λίστα:"))
    #βάζει τους αριθμούς στην λίστα
while (( ar>= "a" and ar <="z") or (ar>="A" and ar<="Z") or (ar>="!" and ar<="*") or (ar>= "α" and ar<="ω") or (ar>= "Α" and ar <= "Ω")):
    print("Εισάγεται αριθμό και όχι χαρακτήρα!")
    ar=(input("Αριθμός στην λίστα:"))

while(ar!=" "):
        #βάζει τους αριθμούς στην λίστα
    lista.append(int(ar))
    size+=1
    ar=(input("Αριθμός στην λίστα:"))

print ("Η λίστα είναι:\n",lista)   #εμφανίζει την λίστα
#βγάζει τα 0 και τα βάζει στο τέλος
i=1
for i in range (size):
    if (lista[i]==0):
        lista.pop(i)
        lista.append(0)

#εμφανίζει την λίστα με τα 0 στο τέλος
print ("Η λίστα έγινε:\n",lista)
print ("!!! ΤΕΛΟΣ ΑΣΚΗΣΗΣ 3 !!!")
